# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [9]:
baby_names.drop(['Unnamed: 0', 'Id'], axis=1, inplace=True)

KeyError: "['Unnamed: 0', 'Id'] not found in axis"

In [10]:
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [16]:
baby_names['Gender'].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [52]:
names = baby_names.groupby("Name")['Count'].sum().reset_index()
names.head()

      Name  Count
0    Aaban     12
1    Aadan     23
2  Aadarsh      5
3    Aaden   3426
4   Aadhav      6


### Step 8. How many different names exist in the dataset?

In [50]:
baby_names['Name'].value_counts()

Name
Riley        1112
Avery        1080
Jordan       1073
Peyton       1064
Hayden       1049
             ...
Anaka           1
Montanna        1
Thaddaeus       1
Miroslav        1
Ackley          1
Name: count, Length: 17632, dtype: int64

### Step 9. What is the name with most occurrences?

In [56]:
names['Count'].idxmax()

7198

In [57]:
names.loc[names['Count'].idxmax(), 'Name']

'Jacob'

### Step 10. How many different names have the least occurrences?

In [63]:
names[names['Count']==names['Count'].min()]

           Name  Count
2       Aadarsh      5
7         Aadin      5
17        Aaima      5
19       Aalaya      5
32      Aaminah      5
...         ...    ...
17600     Zyien      5
17603     Zyire      5
17605  Zykeriah      5
17608  Zykierra      5
17616    Zymari      5

[2578 rows x 2 columns]

### Step 11. What is the median name occurrence?

In [66]:
names[names['Count'] ==names['Count'].median()]

          Name  Count
524    Aishani     49
637      Alara     49
986     Alysse     49
1083     Ameir     49
1360     Anely     49
...        ...    ...
15403   Sriram     49
16250  Trinton     49
16622     Vita     49
17119     Yoni     49
17570  Zuleima     49

[66 rows x 2 columns]

### Step 12. What is the standard deviation of names?

In [68]:
names['Count'].std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [69]:
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000